CSI API ETABS v1

# eLinkPropType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eLinkPropType

    Public Enumeration eLinkPropType

    Dim instance As eLinkPropType

    public enum class eLinkPropType

    type eLinkPropType

Members

| Member name| Value| Description
---|---|---|---
| Linear| 1|
| Damper| 2|
| Gap| 3|
| Hook| 4|
| PlasticWen| 5|
| Isolator1| 6|
| Isolator2| 7|
| MultilinearElastic| 8|
| MultilinearPlastic| 9|
| Isolator3| 10|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com